19_init-org.org
# -*- coding: utf-8; -*-

* header
  #+BEGIN_SRC emacs-lisp
    ;; -*-mode: emacs-lisp; coding: utf-8; buffer-read-only: t;-*-
  #+END_SRC

* org 
** require                                          :deprecatedby:spacemacs:
   #+BEGIN_SRC emacs-lisp :tangle no
     (require 'org)
     (require 'calendar)
     (require 'org-agenda)
     (require 'evil-org)
   #+END_SRC
** setting
   #+BEGIN_SRC emacs-lisp

     ;; babel 에서 C-c' (org-edit-src-code 를 사용할 수 있다)

     ;;     #+STARTUP: overview
     ;;     #+STARTUP: content
     ;;     #+STARTUP: showall
     ;; 파일마다 위의 것을 적어서 조절할 수 있다. 전체는 다음과 설정이 같다. 
     ;;(setq org-startup-folded t)
     (global-set-key "\C-cl" 'org-store-link)
     (global-set-key "\C-ca" 'org-agenda)
     (global-set-key "\C-cb" 'org-switchb)

     (setq org-export-with-sub-superscripts nil )
     ;; capture 를 사용한다. 

     (setq org-log-done t)

     (add-hook 'org-mode-hook 'turn-on-font-lock) ; Org buffers only


     ;;; https://github.com/keelerm84/.emacs.d
     ; Make sure the code in begin_src blocks is colorized both when
     ; editing and when exporting.
     ;;(require 'ox-latex)
     ;; (setq org-latex-listings 'minted)
     ;; (add-to-list 'org-latex-packages-alist '("" "minted"))
     (setq org-src-fontify-natively t)


     (setq org-log-done 'time)

     ;; (setq org-directory "~/Documents/Dropbox/OrgFiles/")
     ;; (setq org-agenda-files `(,org-directory))
     ;; (setq org-default-notes-file (concat org-directory "refile.org"))

     ; Targets include this file and any file contributing to the agenda - up to 9 levels deep
     (setq org-refile-targets (quote ((nil :maxlevel . 9)
                                      (org-agenda-files :maxlevel . 9))))

     ; Use full outline paths for refile targets - we file directly with IDO
     (setq org-refile-use-outline-path t)

     ; Targets complete directly with IDO
     (setq org-outline-path-complete-in-steps nil)

     ; Allow refile to create parent tasks with confirmation
     (setq org-refile-allow-creating-parent-nodes (quote confirm))

     ; Use IDO for both buffer and file completion and ido-everywhere to t
     ;; (setq org-completion-use-ido t)
     ;;(setq ido-everywhere t)
     (setq ido-max-directory-size 100000)
     ;; deprecated ;; (ido-mode (quote both))
     ;; (ido-mode nil)

     (set-face-foreground 'org-level-5 "aquamarine4")

     (use-package os-fs-tree :commands org-fs-tree-dump )

     ;; save all the agenda files after each capture
     (add-hook 'org-capture-after-finalize-hook 'my/save-all-agenda-buffers)


     (use-package cal-korea-x)

     ;; http://nadeausoftware.com/articles/2007/11/latency_friendly_customized_bullets_using_unicode_characters
     ;; (eval-after-load 'org-bullets '(setq org-bullets-bullet-list '("✺" "✹" "✸" "✷" "✶" "✭" "✦" "■" "▲" "●" )))
     ;; "✺" "✹" "✸" "✷" "✶" "✭" "✦" "■" "▲" "●"


     ;; (use-package org-bullets
     ;;   :config
     ;;   (setq org-bullets-bullet-list '( "✸" "✷" "✶" "★"  "☆" "⚝" "✦" "■" "▲" "●" ))
     ;; ;; "✺" "✹"
     ;;   )




     (use-package ox-reveal)
     (use-package ox-html5presentation)
     (use-package org-protocol)
   #+END_SRC

** custom insert heading

   #+BEGIN_SRC emacs-lisp

     (fset 'org-insert-heading-origin 'org-insert-heading)
     (defun org-insert-heading (&optional force-heading invisible-ok)
       "Insert a new heading or item with same depth at point.
          If point is in a plain list and FORCE-HEADING is nil, create a new list item.
          If point is at the beginning of a headline, insert a sibling before the
          current headline.  If point is not at the beginning, split the line,
          create the new headline with the text in the current line after point
          \(but see also the variable `org-M-RET-may-split-line').

          When INVISIBLE-OK is set, stop at invisible headlines when going back.
          This is important for non-interactive uses of the command."
       (interactive "P")
       (if (or (= (buffer-size) 0)
               (and (not (save-excursion
                           (and (ignore-errors (org-back-to-heading invisible-ok))
                                (org-at-heading-p))))
                    (or force-heading (not (org-in-item-p)))))
           (progn
             (insert "\n* ")
             (run-hooks 'org-insert-heading-hook))
         (when (or force-heading (not (org-insert-item)))
           (let* ((empty-line-p nil)
                  (level nil)
                  (on-heading (org-at-heading-p))
                  (head (save-excursion
                          (condition-case nil
                              (progn
                                (org-back-to-heading invisible-ok)
                                (when (and (not on-heading)
                                           (featurep 'org-inlinetask)
                                           (integerp org-inlinetask-min-level)
                                           (>= (length (match-string 0))
                                               org-inlinetask-min-level))
                                  ;; Find a heading level before the inline task
                                  (while (and (setq level (org-up-heading-safe))
                                              (>= level org-inlinetask-min-level)))
                                  (if (org-at-heading-p)
                                      (org-back-to-heading invisible-ok)
                                    (error "This should not happen")))
                                (setq empty-line-p (org-previous-line-empty-p))
                                (match-string 0))
                            (error "*"))))
                  (blank-a (cdr (assq 'heading org-blank-before-new-entry)))
                  (blank (if (eq blank-a 'auto) empty-line-p blank-a))
                  pos hide-previous previous-pos)
             (cond
              ((and (org-at-heading-p) (bolp)
                    (or (bobp)
                        (save-excursion (backward-char 1) (not (outline-invisible-p)))))
               ;; insert before the current line
               (open-line (if blank 2 1)))
              ((and (bolp)
                    (not org-insert-heading-respect-content)
                    (or (bobp)
                        (save-excursion
                          (backward-char 1) (not (outline-invisible-p)))))
               ;; insert right here
               nil)
              (t
               ;; somewhere in the line
               (save-excursion
                 (setq previous-pos (point-at-bol))
                 (end-of-line)
                 (setq hide-previous (outline-invisible-p)))
               (and org-insert-heading-respect-content (org-show-subtree))
               (let ((split
                      (and (org-get-alist-option org-M-RET-may-split-line 'headline)
                           (save-excursion
                             (let ((p (point)))
                               (goto-char (point-at-bol))
                               (and (looking-at org-complex-heading-regexp)
                                    (match-beginning 4)
                                    (> p (match-beginning 4)))))))
                     tags pos)
                 (cond
                  (org-insert-heading-respect-content
                   (org-end-of-subtree nil t)
                   (when (featurep 'org-inlinetask)
                     (while (and (not (eobp))
                                 (looking-at "\\(\\*+\\)[ \t]+")
                                 (>= (length (match-string 1))
                                     org-inlinetask-min-level))
                       (org-end-of-subtree nil t)))
                   (or (bolp) (newline))
                   (or (org-previous-line-empty-p)
                       (and blank (newline)))
                   (open-line 1))
                  ((org-at-heading-p)
                   (when hide-previous
                     (show-children)
                     (org-show-entry))
                   (looking-at ".*?\\([ \t]+\\(:[[:alnum:]_@#%:]+:\\)\\)?[ \t]*$")
                   (setq tags (and (match-end 2) (match-string 2)))
                   (and (match-end 1)
                        (delete-region (match-beginning 1) (match-end 1)))
                   (setq pos (point-at-bol))
                   (or split (end-of-line 1))
                   (delete-horizontal-space)
                   (if (string-match "\\`\\*+\\'"
                                     (buffer-substring (point-at-bol) (point)))
                       (insert " "))
                   (newline (if blank 2 1))
                   (when tags
                     (save-excursion
                       (goto-char pos)
                       (end-of-line 1)
                       (insert " " tags)
                       (org-set-tags nil 'align))))
                  (t
                   (or split (end-of-line 1))
                   (newline (if blank 2 1)))))))
             (insert head) (just-one-space)
             (setq pos (point))
             (end-of-line 1)
             (unless (= (point) pos) (just-one-space) (backward-delete-char 1))
             (when (and org-insert-heading-respect-content hide-previous)
               (save-excursion
                 (goto-char previous-pos)
                 (hide-subtree)))
             (run-hooks 'org-insert-heading-hook)))))
   #+END_SRC
